# UV Constructor (Double, Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UV Constructor (Double, Double)
UV Class See Also
---
Creates a UV with the supplied coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public UV(
	double u,
	double v
)
```

Visual Basic
---
```text
Public Sub New ( _
	u As Double, _
	v As Double _
)
```

Visual C++
---
```text
public:
UV(
	double u,
	double v
)
```

# ### Parameters
u
    Type: System..::..DoubleThe first coordinate.
v
    Type: System..::..DoubleThe second coordinate.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when setting an infinite number to the U or V property. |

# See Also
UV Class
UV Overload
Autodesk.Revit.DB Namespace